app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment", "てすとこめんとでーす"], ["created_at", Sat, 23 Jun 2012 10:52:28 UTC +00:00], ["updated_at", Sat, 23 Jun 2012 10:52:28 UTC +00:00], ["user_id", 1]]