app/controllers/welcome_controller.rb

SELECT "users".* FROM "users" WHERE (users.deleted_at IS NOT NULL)
SELECT "users".* FROM "users" WHERE "users"."id" = 1 AND ("users"."deleted_at" IS NULL) LIMIT 1
---
  def index
    @users = User.all
    @deleted_users = User.only_deleted
    #@comments = Comment.all

    @comments = Comment.find(:all, :joins => "inner join users on users.id = comments.user_id")